[{
        "coreArea": "Business",
        "description": " The core area is intended to provide the student with the qualifications needed to incorporate organisational aspects into multimedia development and use, and to enable the student to plan, manage and carry out a development project.",
        "numberOfECTS": "10 ECTS",
        "knowledge": [" key topics within multimedia-related commercial law, including copyright, data protection law and contract law"," a company’s control, communication and decision-making processes"," the possible organisational consequences of implementing multimedia productions in an organisation"," key methods and tools related to financial planning and control of multimedia productions"," key innovation and entrepreneurship topics"],
        "skills": [" Assess the vision, mission and values as well as the strategy and culture of organisations in relation to multimedia productions"],
        "competences": [" apply relevant theories, methods and IT tools for planning, control and quality assurance of development projects"," participate in disciplinary and interdisciplinary teams both internally and externally based on a professional approach"," acquire new knowledge, skills and competencies of relevance to the profession"]

    }, {
        "coreArea": "Communication and Presentation",
        "description": " The core area is designed to contribute to the acquisition of the knowledge, skills and competen-cies needed to handle communication in relation to multimedia tasks. The student is able to handle communication channels and opportunities in complex organisations and networks, both locally and globally.",
        "numberOfECTS": "20 ECTS",
        "knowledge": [" key communication theory and method applied in the multimedia field"," key marketing theory and method applied in the multimedia field"," key applied communicative tools and techniques and genres"," key concepts in the field of media sociology (the use of digital media by different social groups, both historically and currently)"],
        "skills": [" collect and assess empirical data on target groups and situations"," apply key methods and tools to describe a target group in relation to multimedia tasks, plan and conduct user tests, build and assess information architecture, including structuring, planning and communicating information"," summarise and communicate a development project in the form of a report"," apply key methods and tools for stakeholder presentations"," assess and apply communication elements in various media productions", " assess the importance of cultural factors to national and international communication"," assess connections between cultural identity and forms of expression", " identify, select and present communication strategies and forms of communication for un-dertaking multimedia tasks in a globalised society"],
        "competences": [" handle communication and marketing across platforms, digital marketing, and interactive communication in multimedia products", " participate in disciplinary and interdisciplinary teams both internally and externally based on a professional approach", " acquire new knowledge, skills and competencies of relevance to the profession"]

    },{
        "coreArea": "Design and Visualisation",
        "description": " The core area is designed to enable the student to apply multimedia design and concept development prin-ciples on a methodological basis. The student is also to acquire the skills needed to design and develop in-teractive user interfaces for key digital platforms on a methodological basis. In addition, the student is to be able to integrate different types of digital media on various digital platforms on a methodological basis.",
        "numberOfECTS": "25 ECTS",
        "knowledge": [" key tools for video and audio production", " key methods for documenting design","the history of design and aesthetics in relation to the multimedia field"," the connection between application and design in the multimedia field"," key theory and method in relation to animation techniques"," key theory and method in relation to narrative and production techniques"],
        "skills": [" present the design-related problems and issues, possible solutions and choice of media mechanisms to stakeholders"," design user interfaces for different digital platforms based on key theory and assessment"," assess and apply key methods for ideation and concept development"," assess and apply key user-oriented design methods, key digital graphic design principles, aesthetic styles in relation to the multimedia field, graphic material for further digital production"," assess and apply methods for documenting interactive multimedia productions, assess and apply techniques for the production and post-processing of video and audio"],
        "competences": [" manage and realise the connection between message and design, and between identity and design"," manage the design and development of interactive user interfaces"," manage and integrate the expression of digital media on different digital platforms"," participate in disciplinary and interdisciplinary teams both internally and externally based on a professional approach"," acquire new knowledge, skills and competencies of relevance to the profession"]

    },{
        "coreArea": "Interaction Development",
        "description": " The core area is designed to enable the student to model, format, structure, document and im-plement dynamic multimedia applications. The student is also to obtain a basic understanding of system development. Furthermore, the student is to acquire the skills needed to structure and implement complex dynamic multimedia applications with the integration of databases.",
        "numberOfECTS": "25 ECTS",
        "knowledge": [" the structure and use of the Internet"," object-oriented programming in relation to multimedia practice"," technical possibilities and limitations of development environments applied in practice"," elements of Content Management Systems (CMS) applied in practice"," key applied theory and method in relation to system development"," interfaces for exchanging data with third-party services"," important security aspects of networks, multimedia applications and data communication"],
        "skills": [" use a database manipulation language applied in practice", " prepare and present documentation in accordance with practice", " assess and apply key methods and tools for search engine optimisation (SEO)"," assess and apply current formatting languages", " program client and server-based multimedia solutions"," apply key methods and tools for modelling, structuring and implementing functionality and databases"," apply key methods for assuring quality through testing and troubleshooting"],
        "competences": [" manage modelling, structuring and formatting of information in accordance with practice"," manage modelling, structuring and programming of functionality"," manage integration of different media types in multimedia applications"," handle data persistence for dynamic multimedia applications"," participate in disciplinary and interdisciplinary teams both internally and externally based on a professional approach"," acquire new knowledge, skills and competencies of relevance to the profession"]
    },{
        "name": " 2nd Semester/First-year Exam – Multimedia Production Basic",
        "numberOfEcts": " 60 ECTS",
        "requirements": " The objective is to test the students’ understanding of the theory, method, and tools acquired through participation in the compulsory program element Multimedia Production Basic. The exam is to demonstrate that the student is able to: communicate visually to a target group, develop an interactive digital product, taking into account the stakeholders, carry out a project in a team.",
        "exam":" The exam covers the core areas of the compulsory program element in the first year of study with the focus on product, report, and process. The exam consists of three elements: 1. Presentation, 2. Examination, 3. Grading and feedback. The specific requirements as regards the duration of the exam are published on the learning platform for the Multimedia Design and Communication program and are forwarded to the co-examiner.",
        "assessment": "The exam is assessed by the examiner and an external co-examiner according to the 7-point grading scale. An individual grade is awarded based on an overall assessment of the report, digital prototype, presentation and the individual exam. The performance is assessed on the basis of whether the goals and learning objectives of the first year of study have been fulfilled as described in the curriculum.",
        "reExam": " Students who fail the first exam attempt are offered two more attempts. The re-exam is held immediately after the beginning of the following semester. The extent of the re-exam is based on an academic assessment of the reason for the need for a re-exam. The purpose of the re-exam is the same as for the ordinary exam.",
        "reExamDueToIllness": " Re-exams due to documented illness or for other acceptable reasons are held immediately before or at the beginning of the following semester. If KEA estimates that the student has been almost fully active in the project work, a make-up exam will be held based on the project work. If KEA estimates that the student has not been almost fully active in the project work, the make-up exam will take the form of a new project exam."
    },
    {
        "name": "1. 3rd Semester Exam – Multimedia Production Advanced",
        "numberOfEcts": " 20 ECTS",
        "requirements": " The objective is to test the students’ understanding of the theory, method and tools acquired through the compulsory program element Multimedia Production Advanced, and the students’ ability to develop a professional profile in relation to the current requirements in the area.",
        "exam":" The exam consists of: Presentation, Examination, Grading, and Feedback",
        "assessment": " The exam is assessed by the examiner and an internal co-examiner according to the 7-point grad-ing scale. Students are awarded one grade for their overall performance, covering production, profile, presentation and exam. The performance is assessed on the basis of whether the students have understood the third-semester goals and learning objectives, as described in the curriculum, and how they are presented.",
        "reExam": " Students who fail the first exam attempt are offered two more attempts. The re-exam is held immediately before the beginning of the following semester. The extent of the re-exam is based on an academic assessment of the reason for the need for a re-exam. The purpose of the re-exam is the same as for the ordinary exam.",
        "reExamDueToIllness": " Re-exams due to documented illness or for other acceptable reasons are held before the beginning of the following semester. If KEA estimates that the student has been almost fully active in the compulsory program elements, the make-up exam will be based on the production and profile. If KEA estimates that the student has not been almost fully active in the compulsory program elements, the make-up exam will be based on a substitution assignment."
    },
    {
        "name": "2. 3rd Semester Exam – Elective Subject",
        "numberOfEcts": " 10 ECTS",
        "requirements": " The elective subject is concluded with a presentation and a discussion, either individually or in groups, of one or more products which the students have developed in connection with the elective subject. The requirements for the presentation and product(s) are made available on the learning platform for the Multimedia Design and Communication program.",
        "exam":" The exam form may vary depending on the objective of the elective subject in question. The exam is described under each elective subject on the learning platform for the Multimedia Design and Communication program.",
        "assessment": " The exam is assessed by the examiner and an internal co-examiner according to the 7-point grading scale. Students are awarded one grade for their overall performance, covering product(s), presentation, and a discussion. The performance is assessed on the basis of whether the students have understood the elective subject goals and learning objectives, as described in the electives catalog, and how they are presented.",
        "reExam": " Students who fail the first exam attempt are offered two more attempts. The re-exam is held immediately before or at the beginning of the following semester. The extent of the re-exam is based on an academic assessment of the reason for the need for a re-exam. The purpose of the re-exam is the same as for the ordinary exam.",
        "reExamDueToIllness": " Re-exams due to documented illness or for other acceptable reasons are held before the beginning of the following semester. If KEA estimates that the student has been almost fully active in the compulsory program elements, the make-up exam will be based on the production and profile. If KEA estimates that the student has not been almost fully active in the compulsory program elements, the make-up exam will be based on a substitution assignment."
    },
    {
        "name": " 4th Semester Exam – Internship",
        "numberOfEcts": " 15 ECTS",
        "requirements": " The internship is concluded with an internship report, a presentation and a discussion of one or more products developed by the student during the internship, as well as of the professional experience gained by the student. The requirements for the report and presentation are described under the guidelines for forth-semester internships.",
        "exam":" The exam is internal and intended to assess the students’ individual learning based on the learning objectives for the internship. The exam consists of: Presentation, Examination, Grading, and Feedback.",
        "assessment": " The exam is assessed internally according to the 7-point grading scale. Students are awarded one grade for their overall performance, covering a report, a presentation and a discussion. The performance is assessed on the basis of whether the students have understood the internship goals and learning objectives, as described in the curriculum, and how they are presented.",
        "reExam": " Students who fail the first exam attempt are offered two more attempts. The re-exam is held immediately after the first attempt. The extent of the re-exam is based on an academic assessment of the reason for the need for a re-exam. The purpose of the re-exam is the same as for the ordinary exam.",
        "reExamDueToIllness": " Re-exams due to documented illness or for other acceptable reasons are held before the final exam in the fourth semester. If KEA estimates that the student has been almost fully active during the internship, the re-exam will be based on the report and the products produced by the student in the course of the internship. If KEA estimates that the student has not been almost fully active during the internship, the student must complete another internship."
    },{
        "name": " 4th Semester Exam – Final Project",
        "numberOfEcts": " 15 ECTS",
        "requirements": " The objective of the final exam project is to document whether the student has acquired the qualifications needed to combine theoretical, methodological and practical elements and to communicate these. The problem statement must be central to the multimedia profession and be prepared by the student in cooperation with a public or private company. Alternatively, the final exam project can be based on the students starting up their own business. KEA must approve the problem statement. The project is concluded with a report and a product, which must be a digital multimedia production. The final exam project must not exceed 45 standard pages for one student + 15 standard pages for each additional group member. Front page, table of contents, bibliography and appendices are not included in the maximum number of pages. Appendices will not be assessed. A standard page is 2,400 characters with spaces and footnotes. Students who are able to document a relevant, specific impairment may apply for an exemption from the requirement that spelling and writing skills are included in the assessment. The application must be submitted to the head of education no later than four weeks prior to the exam.",
        "exam":" The exam is external and covers the core areas of knowledge, qualifications and competencies which a multimedia designer is to acquire during the program. The exam consists of: Presentation, Examination, Grading, and Feedback",
        "assessment": " The exam is external and assessed according to the 7-point grading scale. The exam consists of a project and an oral part. One aggregate grade is awarded. To sit the exam, students must have passed their internship exam and all other exams on the program. For further information on exam form and structure etc., reference is made to the institution-specific part of the curriculum.",
        "reExam": " Students who fail the first exam attempt are offered two more attempts. Re-exams are held within two months of the first attempt. The extent of the re-exam is based on an academic assessment of the reason for the need for a re-exam. The purpose of the re-exam is the same as for the ordinary exam.",
        "reExamDueToIllness": " Re-exams due to documented illness or for other acceptable reasons are held within two months of the ordinary exam. If KEA estimates that the student has been almost fully active during the exam project period, the re-exam will be based on the initial problem statement. If KEA estimates that the student has not been almost fully active during the exam project period, the re-exam will be based on a new problem statement."
    }
]
